import 'package:Tornado/theory/widgets/theory_detail_item.dart';

const title = "Школа тхэквондо ТОРНАДО";
const taekwonDoText =
    'Тхэквондо – в переводе с корейского обозначает "путь руки и ноги", где "тхэ" – удар ногой в прыжке, "квон" – удар кулаком, "до" – путь. Название отражает суть единоборства, где 70 процентов ударов наносится ногами, а 30 процентов – руками. Тхэквондо – динамично развивающийся вид спорта. По этому зрелищному единоборству регулярно проводятся официальные турниры, включённые в календарный план Российских Международных соревнований по физической культуре и спорту.';
const choyHonHiText = 'Основатель Тхэквондо, генерал Чой Хон Хи';
const parkJungTaeText =
    'Основатель Тхэквондо ГТФ,\n Гранд мастер\n Пак Джун Тэ';
const choyTalkText =
    'Основатель тхэквондо Чой Хон Хи родился 9 ноября 1918 года в Хадэ (Корея). Его детство и юность пришлись на тот период, когда Корея была оккупирована Японией. Чой Хон Хи в юности изучал Сётокан-каратэ-до и после усердных тренировок стал обладателем чёрного пояса — высшего дана.Активно участвовал в национально-освободительном движении корейских студентов, за что был взят в плен японцами и был освобождён лишь после капитуляции Японии во Второй Мировой войне в 1945 году.В 1946 году он поступил на службу в только что созданную корейскую армию инструктором по каратэ (Тансудо). Обучая солдат приёмам карате, Чой Хон Хи постоянно совершенствовал методику занятий, да и сами приёмы. В результате этих экспериментов в течение последующих десяти лет он создал фактически новое боевое искусство, которое было названо «тхэквондо». Благодаря своим заслугам Чой Хон Хи достаточно быстро дослужился до звания генерала.Вот, как он сам описывает своё дело: «К концу 1954 года я почти закончил разработку нового корейского боевого искусства, a 11 апреля 1955 года дал ему имя «тхэквондо».На духовном уровне тхэквондо ИТФ выросло из традиций этических и моральных принципов восточной и, конечно же, моей собственной философии».';
const beloglazovText =
    'Председатель правления \n Школы тхэквондо "ТОРНАДО" \n Белоглазов Андрей Сергеевич';
const beloglazovTalkText =
    'Что такое тхэквондо? Что в нем особенного, отличного от других единоборств и спортивных секций? Почему стоит выбрать именно тхэквондо? \n На эти и многие другие вопросы есть один ответ, очень простой и в то же время исключительно сложный. Тхэквондо – это вид боевого искусства, не знающий равных по мощности и эффективности. Для многих тхэквондо становится стилем жизни, ведь это вид боевого  искусства со своими правилами и со своей философией. \n Тхэквондо служит эффективным средством не только физического, но и нравственного совершенствования, гармоничного развития личности, так как формирует внутреннюю культуру человека, его характер, дисциплину, волю, воспитывает коллективизм, развивает чувства обязательности и ответственности. Для каждого спортсмена большая честь быть одетым в боевую форму, которая имеет особый дух сплоченности. А пройти аттестацию на пояса (белый, желтый, черный), означает сдать экзамен на зрелость. \n Тхэквондо позволяет овладеть уверенностью в себе, быть способным защитить себя и окружающих. Вместе с этим развиваются скорость мышления, интуиция, умение управлять своим телом и своими эмоциями.\n Тхэквондо это целая жизнь: турниры, семинары, спортивные лагеря, общение с людьми не только с разных регионов необъятной России, но и с разных стран, континентов. \n Школа Тхэквондо «ТОРНАДО» начинает свою историю с 2002 года. Именно тогда четверо молодых тренеров создали организацию для дальнейшего развития. Как результат за плечами наших учеников победы на первенствах и чемпионатах России и Мира. Сегодня наша Школа является одним из лидеров Российского тхэквондо. \nМы гордимся успехами наших воспитанников и рады, что победы в спорте учат их добиваться самых высоких побед в жизни. Дети, познавшие радость первых побед, начинают понимать, что они способны добиваться желаемых результатов и делать что-то лучше других.\n Мы ждем тебя. Двери ДОДЖАНА открыты! Открой себя с новой стороны!\n А.С. Белоглазов';

final aboutUsData = [
  TheoryDetailItem(
    text: '',
    imagePath: 'assets/images/theory_screen/about_us/ParkJungTae.jpg',
    imageDescription: parkJungTaeText,
  ),
  TheoryDetailItem(
    text: taekwonDoText,
    imagePath: 'assets/images/theory_screen/about_us/ChoyHonHi.jpg',
    imageDescription: choyHonHiText,
  ),
  TheoryDetailItem(
    text: choyTalkText,
    imagePath: 'assets/images/theory_screen/about_us/Beloglazov.jpeg',
    imageDescription: beloglazovText,
  ),
  TheoryDetailItem(
    text: beloglazovTalkText,
  ),
];
