import 'package:Tornado/theory/widgets/theory_detail_item.dart';

const paragraf1Text =
    'Земледелию, рыболовству, охоте, медицинским наукам, торговле, письменности обучали еще в период трех мифических императоров в Китае, около 3500 лет до нашей эры. Фрески на куполах вдоль Нила и иероглифы, высеченные на пирамидах, служат доказательством тому, что египтяне практиковали рукопашные бои, очень напоминавшие современный бокс, еще в трехтысячном году до нашей эры. Мы также располагаем сведениями о существовавшей технике рукопашного боя, применявшейся воинами древней Месопотамии и Шумера (3000 г. до нашей эры - 2300 г. до наш ей эры ).';
const paragraf2Text =
    'Таким образом, мы легко можем представить себе, как много для человека древности значили руки и ноги в борьбе против своих врагов, хищных зверей и проявлений природной стихии. С развитием человечества, с накоплением знаний, эти грубые, примитивные методы ведения рукопашного боя постепенно совершенствовались. В итоге они систематизировались и трансформировались в военное искусство. Во  времена существования древнегреческих городов- государств (XII век до наш ей эры) нечто напоминающее бокс и борьбу, а также и другие формы и виды спортивных состязаний регулярно включались в “программы” античных олимпийских игр. В поэмах Гомера описываются рукопашные бои. Греческий философ Платон упомянул о соревнованиях, где в  борьбе участвовал только один боец, имитировавший настоящий бой - это можно считать прообразом тылей. Это была форма атлетического состязания, в котором сочетались элементы борьбы и бокса. Это была система борьбы, в которой все тело использовалось в качестве оружия.';
const paragraf3Text =
    'В Древнем Риме греческие состязания трансформировались в бои гладиаторов. Состязания гладиаторов проводились для развлечения зрителей во времена расцвета Римской империи. Подобные зрелища постепенно распространились в Германии, Нормандии и Британии. Все это составило основу для современных бокса и борьбы . Известно, что в Китае различные формы рукопашного боя широко практиковались еще в древнейшие времена. По всему миру развивалось большое количество различных стилей борьбы руками и ногами, и каждая из них отражала веяния времени и различные исторические и культурные традиции той страны, где она возникала. В Китае рукопашный бой носил название кунг-фу или Дэличон, в Индии - селамбам, во Франции - сават, в Японии - дзю до, каратэ, айкидо, джиу-джитсу, в России - самбо, в Малайзии - босилат, в Таиланде - Муай Тай, в Корее он известен, как таэк-кьюн, субак-джи и тхэквондо. Некоторые из этих форм самозащиты столь же древни, как и само человечество. Существует великое множество легенд о происхождении борьбы без оружия. И, вполне возможно, что они могут иметь реальную историческую основу. Некоторые авторитеты утверждают, что основные формы рукопашного боя возникли в Китае и разработаны неким буддистским монахом Бодхихармой (его еще называют по-китайски - Тамо, или Дарума - по-японски) в шестом веке. Монах этот был третьим сыном индийского правителя Брахмана, известного, как 28-й патриарх буддистского клана Чэн.';
const paragraf4Text =
    'Сущность Чэн - проповедь спокойствия - заключается в отрицании стремления к материальным благам, власти, в порицании жадности и тщеславия. А достигалось это через просвещение. Монах Дарума (448-529 гг.) однажды отправился в путь из южно-индийского буддистского монастыря в Китай через Гималаи, чтобы открыть перед монархом из династии Лян сущность буддизма. По прибытии в Китай, как гласит древняя легенда,он направился в храм Шаолинь, расположенный в горах Шао Шик. Это было в 520 году. Он задался целью проповедовать буддизм. Монахи Шаолиня в силу очень жесткой дисциплины и притеснений со стороны местной власти были на грани физического истощения. И тогда Дарума открыл им метод умственного и физического развития и закалки, описанные в книгах “И-йин кенг” (“Развитие мускулов”) и “Си шим кенг” (“Очищение разума”). Все это было нацелено на умственную разрядку и постижение основ нового учения. В то ж е время, все это дополнялось освоением приемов “Ших па ло-хан” (“18 движений рук”), которые повторяли 18 поз различных идолов храма Шаолинь. В результате монахи Шаолиня стали самыми сильными бойцами Китая. Считается, что этот метод в сочетании с “18 движениями рук” стал основой для создания отличной системы Шаолинь или Чан Фа (“Метод кулака Шаолинь”).';
const paragraf5Text =
    'Эта легенда подкрепляется некоторыми историческими фактами. Из тщательного анализа событий выясняется, что Дарума оказался в Китае в период правления династии Лян. Монах предпринял попытку приобщить короля Му Йэ к буддизму, но получил отказ и не был допущен в королевский дворец. Поэтому Дарума отправился в маленькое государство на севере Китая. Там ему предложили заняться обучением короля этого государства. По неизвестным причинам Дарума отказался от этого предложения и обосновался в стенах храма Шаолинь, где и прожил девять лет до самой смерти, посвятив себя раздумьям и воспоминаниям. В период с I по VII век до наш ей эры Корейский полуостров был разделен на три государства - Силла, Когуре и Бэк Йэ. Силла - самое маленькое королевство, постоянно подвергалась нападениям со стороны более крупных и сильных соседей с севера и запада. В период правления двадцать четвертого короля Силлы молодые аристократы и воины, из числа знати, создали элитарный офицерский корпус, так называемый Хва Ранг До. В этом корпусе помимо обычных воинских упражнений с копьем, луком, саблей и палкой, также изучали приемы, направленные на совершенствование умственной и физической подготовки, осваивая удары руками и ногами. В целях закалки тела и характера воины лазали по крутым горным склонам, плавали в стремительных бурных речках, невзирая на время года и погоду. Словом, они упорно готовились к защите родины от агрессоров.';
const paragraf6Text =
    'Они выработали свой устав из пяти пунктов, чтобы определить цели создания своего корпуса. \nВот пять пунктов этого устава: 1. Будь верен своему Королю.2. Подчиняйся своим родителям.3. Будь честен со своими друзьями.4. В битве никогда не отступай.5. Будь бесстрашным.Офицеры корпуса Хва Ранг до очень быстро приобрели известность на полуострове. Благодаря своему мужеству и умению сражаться в боях даже с превосходящим противником, они завоевали уважение и среди злейших своих врагов. Силы, которые они черпали в принципах, заложенных в устав, дали возможность достичь военного превосходства над противником . Очевидно, что занятия тхэквондо рекомендуются мужчинам, женщинам и детям. Оно развивает органы восприятия и движения, сосредоточенность, зрение, мускулы, аэробное кондиционирование сердца и легких, способность владеть своим телом, что очень важно в занятиях другими видами спорта или физической деятельности. Сочетание очевидных преимуществ самозащиты с удовольствием от владений древним видом боевого искусства, может сделать тхэквондо частью жизни всех людей до конца их жизни.';
const worldChampionshipText = "Чемпионат мира г. Казань, 2016 г.";
const may9Text = "Пробег, посвященый Победе в Великой Отечественной Войне.";
const championshipRussiaText = "Чемпионат России г. Казань, 2019 г. ";
const championshipEuropeText = "Чемпионат Европы г. Казань, 2019 г.";

final historyData = [
  TheoryDetailItem(
    text: paragraf1Text,
    imagePath: 'assets/images/theory_screen/history/ChaDanil.JPG',
    imageDescription: 'Показательные выступления.',
  ),
  TheoryDetailItem(
    text: paragraf2Text,
    imagePath: 'assets/images/theory_screen/history/May9.jpeg',
    imageDescription: may9Text,
  ),
  TheoryDetailItem(
    text: paragraf3Text,
    imagePath: 'assets/images/theory_screen/history/ChampionshipRussia2019.jpg',
    imageDescription: championshipRussiaText,
  ),
  TheoryDetailItem(
    text: paragraf4Text,
    imagePath:
        'assets/images/theory_screen/history/ChampionshipEurope2019.jpeg',
    imageDescription: championshipEuropeText,
  ),
  TheoryDetailItem(
    text: paragraf5Text,
    imagePath: 'assets/images/theory_screen/history/WorldChampionship.jpeg',
    imageDescription: worldChampionshipText,
  ),
  TheoryDetailItem(
    text: paragraf6Text,
  ),
];
