import 'package:Tornado/theory/widgets/theory_detail_item.dart';

const introductionText =
    'Тхэквондо или таэквон-до? Во всем мире используется термин таеквон-до (taekwon-do), но так как словосочетание а-э в Корейском языке нет, правильнее произносить тхэквондо. В документации министерства спорта РФ используются именно этот термин - тхэквондо. Однако в обоих случаях произношение и написание будет правильным.\nУспех или неудача тренировок зависит от того, как ученик соблюдает и выполняет принципы, которые служат путеводной звездой для всех, всерьез посвятивших себя боевым искусствам.';
const principleOneText =
    '1. УВАЖЕНИЕ И ВЕЖЛИВОСТЬ (YE UI) Уважение и вежливость - качества необходимые любому воспитанному человеку. Ученик должен уважать то место, где он получает знания (учебный класс, спортивный зал и т.д.), и тогда это место ответит вам рабочей атмосферой, в этом месте вы будете чувствовать себя комфортно, и те слова и действия, которые будут вами выполнены, останутся с вами. Уважение к своей форме и снаряжению учит быть опрятным и аккуратным, снаряжение прослужит долго, а в форме будет удобно заниматься. Уважать своего наставника - значит быстро получать от него знания. Уважать и быть вежливым к своему партнеру - означает в процессе обучения быстро учиться и давать учиться вашему товарищу. В поединке с соперником, которого уважаете, вы не получите травм.';
const principleTwoText =
    '2. ЧЕСТНОСТЬ И ДОБРОТА (YOM CHI) Честность в боевых искусствах - это: - выполнение всех заданий тренера в зале и дома в полном объеме; - выполнение всех упражнений с полной концентрацией, вкладывая в каждый прием всю силу; - выполнение заданий без злости, которая мешает сконцентрироваться на правильном выполнении заданий и разрушает технику; - помощь товарищу во время занятий, взаимовыручка.';
const principleThreeText =
    '3. НАСТОЙЧИВОСТЬ И ТЕРПЕНИЕ (IN NAE)Настойчивость и терпение вырабатывает в человеке хорошие черты. Только тот человек сможет достичь в любом деле прогресса, который настойчиво овладевает знаниями и прилагает определенные усилия, когда у него что-то не получается. Одним из важнейших слагаемых лидерства в боевых искусствах является преодоление любых трудностей и препятствий. Только упорством и терпением можно достичь высокого мастерства. Конфуций сказал: "Человек, не имеющий терпения в обычных делах, редко достигает успеха в делах, имеющих огромную значимость».';
const principleFourText =
    '4. САМООБЛАДАНИЕ И САМОКОНТРОЛЬ (GUK GI) Для человека, занимающегося восточными единоборствами, чрезвычайно важно обладать самоконтролем. Важно проявлять самоконтроль и самообладание, как во время соревнований, так и в обычных делах. Потеря самоконтроля может закончиться плачевно во время соревнований для тебя самого и для твоего соперника. Неумение жить и работать в рамках своих возможностей, также можно считать отсутствием самообладания. Согласно Лао-цзы, термин «сильный» можно отнести к человеку, который способен побороть себя без принуждения со стороны других. Невозможно побороть других, не одержав победы над самим собой.';
const principleFiveText =
    '5. СИЛЬНЫЙ ДУХ (BAEKJUL BOOLGOOL) Сильный дух обычно проявляется в неожиданных ситуациях перед лицом беды. Настоящий ученик боевых искусств будет скромен и честен всегда. Столкнувшись с несправедливостью, он предстанет перед враждебной стороной без всякого страха и колебаний, независимо от количества и силы противоборствующих.';

final principlesData = [
  TheoryDetailItem(
    text: introductionText,
    imagePath: 'assets/images/theory_screen/priciples/principle1.JPG',
  ),
  TheoryDetailItem(
    text: principleOneText,
    imagePath: 'assets/images/theory_screen/priciples/principle2.JPG',
  ),
  TheoryDetailItem(
    text: principleTwoText,
    imagePath: 'assets/images/theory_screen/priciples/principle3.JPG',
  ),
  TheoryDetailItem(
    text: principleThreeText,
    imagePath: 'assets/images/theory_screen/priciples/principle4.JPG',
  ),
  TheoryDetailItem(
    text: principleFourText,
    imagePath: 'assets/images/theory_screen/priciples/principle5.JPG',
  ),
  TheoryDetailItem(
    text: principleFiveText,
  ),
];
